elasticHBPF_nochemical_mechanical_stabilization/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    OUTLET
    {
        type            zeroGradient;
    }

    INLET
    {
        type            fixedValue;
        value           uniform (1.1737e-4 0 0);
    }



    
    WALL1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    	   
    }

    WALL2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    	   
    }
    

   
    FRONTBACK1
    {
        type            empty;
    }
    FRONTBACK2
    {
        type            empty;
    }

}

// ************************************************************************* //
