elasticHBPF_nochemical_mechanical_stabilization/0/nfree
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nfree;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];//mol m^-3

internalField   nonuniform List<scalar> 
3000
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    FRONTBACK1
    {
        type            empty;
    }
    FRONTBACK2
    {
        type            empty;
    }
    INLET
    {
        type            zeroGradient;
    }
    WALL2
    {
        type            zeroGradient;
    }
    WALL1
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
