elasticHBPF_nochemical_mechanical_stabilization/0/ntot.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \/     M anipulation  |                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epss;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1e-20;
 


boundaryField
{
    OUTLET
    {
        type            zeroGradient;
    }

    WALL1
    {
        type            zeroGradient;
    }
    WALL2
    {
        type            zeroGradient;
    }



   
    FRONTBACK1
    {
        type            empty;
    }
    FRONTBACK2
    {
        type            empty;
    }



    INLET
    {
        type            zeroGradient;
    }
}
