elasticHBPF_nochemical_mechanical_stabilization/constant/fvOptions_vectorSemiImplicitSource
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



porositySource
{
    
        type            tensorSemiImplicitSource;
        active          true;
 

        selectionMode    cellZone;
        cellZone         clot;
        volumeMode       absolute;
        injectionRateSuSp
        {
            U      ((0 0 0) (-1e8 -1e8 -1e8)); 
        }
        
    
}
// ************************************************************************* //
