elasticHBPF_nochemical_mechanical_stabilization/constant/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


planeStress no;

rho_s           rho_s [1 -3 0 0 0 0 0] 1000;
EInfinity       EInfinity [1 -1 -2 0 0 0 0] 3e8;
nu              nu [0 0 0 0 0 0 0] 0.3;
E               (1e8 1.8e8);
relaxationTimes (1 30);      
mu0             mu0 [1 -1 -2 0 0 0 0] 9.6;                   
mu1             mu1 [1 -1 -2 0 0 0 0] 12.6;                  
mu2             mu2 [1 -1 -2 0 0 0 0] 51.5;               
alpha           (2 4 2);        
beta            beta [0 0 0 0 0 0 0] 1.0;             
//K               K [1 -1 -2 0 0 0 0] 1e8;                 

stabilization
{
    type RhieChow;
    scaleFactor 0.1;
    interfaceScaleFactor 0.01;
    useCellZones false;
}

// ************************************************************************* //
