elasticHBPF_nochemical_mechanical_stabilization/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel Newtonian;
nuf              [0 2 -1 0 0 0 0] 0.0000033018867; //fluid's kinematic viscocity
nu               [0 2 -1 0 0 0 0] 0.0000033018867; //fluid's kinematic viscocity
rhof             [1 -3 0 0 0 0 0] 1060; //fluid's density
rho              [1 -3 0 0 0 0 0] 1060; //fluid's density
rhos             [1 -3 0 0 0 0 0] 1000; //solid's density
k0inv            [0 -2 0 0 0 0 0]  6.63346e14;   //inverse of intrinsic permeability
Fkinv            [0 -2 0 0 0 0 0]  0;   //Ferrari Drag term
sigmacoe         [0 0 0 0 0 0 0]  0; //Terzaghi Coeff.
Rf0              Rf0      [0 1 0 0 0 0 0] 0.0000004;          //// 400 nm
epssEq           [0 0 0 0 0 0 0] 0.04;
phif0            phif0    [0 0 0 0 0 0 0] 0.2;               //// 1-eps0
DTtPA            DTtPA [0 2 -1 0 0 0 0] 0.00000000005;     //// 5e-11 m^2/s
DTPLG            DTPLG [0 2 -1 0 0 0 0] 0.00000000005;     //// 5e-11 m^2/s
DTPLS            DTPLS [0 2 -1 0 0 0 0] 0.00000000005;     //// 5e-11 m^2/s
DTFBG            DTFBG [0 2 -1 0 0 0 0] 0.00000000005;     //// 5e-11 m^2/s
DTAP             DTAP [0 2 -1 0 0 0 0] 0.00000000005;     //// 5e-11 m^2/s
DTPAI            DTPAI [0 2 -1 0 0 0 0] 0.00000000005;     //// 5e-11 m^2/s
DTMG             DTMG [0 2 -1 0 0 0 0] 0.00000000005;     //// 5e-11 m^2/s
DTPLS_AP         DTPLS_AP [0 2 -1 0 0 0 0] 0.00000000005;     //// 5e-11 m^2/s
Df               [0 2 -1 0 0 0 0] 0.00000000005;
n                [0 0 0 0 0 0 0] 1;
krxn             [0 0 -1 0 0 0 0] 0;
epss0            epss0 [0 0 0 0 0 0 0] 0.05;
ntot0            ntot0 [0 -3 0 0 1 0 0] 0.000189;           //// mol m^-3
ELcrit           ELcrit   [0 0 0 0 0 0 0] 0.5;                ////
//adsorption and desorption of fibrinolytic proteins
katPA            katPA    [0 3 -1 0 -1 0 0] 10;               //// m^3/(mol s) // 0.01 1/(muM s)
kdtPA            kdtPA    [0 0 -1 0 0 0 0] 0.0058;            //// 1/s         // 0.0058 1/s
kaPLG            kaPLG    [0 3 -1 0 -1 0 0] 100;              //// m^3/(mol s) // 0.1 1/(muM s)
kdPLG            kdPLG    [0 0 -1 0 0 0 0] 3.8;               //// 1/s         // 3.8 1/s
kaPLS            kaPLS    [0 3 -1 0 -1 0 0] 100;              //// m^3/(mol s) // 0.1 1/(muM s)
kdPLS            kdPLS    [0 0 -1 0 0 0 0] 0.05;              //// 1/s         // 0.05 1/s
//lysis related parameters
KM               KM       [0 -3 0 0 1 0 0] 1.6e-4;            //// mol m^-3    // 0.16 muM
kdeg             kdeg     [0 0 -1 0 0 0 0] 2.178;             //// 1/s         // 2.178 1/s
gamma            gamma    [0 0 0 0 0 0 0] 0.1;                ////
k_MM             k_MM     [0 0 -1 0 0 0 0] 0.3;               //// 1/s
//Kinetic parameters
/*********Reaction 1. PLG-->PLS by tPA, Michaelis Menten****************/
k1f              k1f      [0 3 -1 0 -1 0 0] 10000;            //// m^3/(mol s) // 10 1/(muM s)
k1r              k1r      [0 0 -1 0 0 0 0] 280;               //// 1/s         // 280 1/s
k2               k2       [0 0 -1 0 0 0 0] 0.3;               //// 1/s         // 0.3 1/s
/******Reaction 2. PLS inactivation by AP, second order Michaelis-Menten****************/
k_AP_r           k_AP_r   [0 0 -1 0 0 0 0] 0.0021;            //// 1/s         // 0.0021 1/s
k_AP_f           k_AP_f   [0 3 -1 0 -1 0 0] 10000;            //// m^3/(mol s) // 10 1/(muM s)
k_AP_cat         k_AP_cat [0 0 -1 0 0 0 0] 0.004;             //// 1/s         // 0.004 1/s
/*********Reaction 3. FBG-->FDP by PLS, Michaelis-Menten************/
k5f              k5f      [0 3 -1 0 -1 0 0] 10000;            //// m^3/(mol s) // 10 1/(muM s)
k5r              k5r      [0 0 -1 0 0 0 0] 300;               //// 1/s         // 300 1/s
k6               k6       [0 0 -1 0 0 0 0] 25;                //// 25 or 250 1/s
/******Reaction 4. PLS inactivation by MG, second order Michaelis-Menten****************/
kMG              kMG      [0 3 -1 0 -1 0 0] 350;              //// m^3/(mol s) // 0.35 1/(muM s)
/******Reaction 5. tPA inhibiation by PAI, second order Michaelis-Menten****************/
kPAI             kPAI     [0 3 -1 0 -1 0 0] 37000;            //// m^3/(mol s) // 37 1/(muM s)
SolveConvectionEqn 0;
//choose if we want to include ddt(porosity) effects on pressure.
pCoeff 0;
// ************************************************************************* //
