elasticHBPF_nochemical_mechanical_stabilization/constant/windkesselProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      windkesselProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mca
{
    C               1.502e-10;
    R               4.341e+09;
    Z               2.07e+09;
    outIndex        0;
    FDM_order       1;
    Flowrate_threeStepBefore 0;
    Flowrate_twoStepBefore 0;
    Flowrate_oneStepBefore 0;
    Pressure_twoStepBefore 0;
    Pressure_oneStepBefore 0;
    Pressure_start  -2.7574e-168;
}

aca
{
    C               7.17e-11;
    R               9.779e+09;
    Z               3.64e+09;
    outIndex        1;
    FDM_order       1;
    Flowrate_threeStepBefore 0;
    Flowrate_twoStepBefore 0;
    Flowrate_oneStepBefore 0;
    Pressure_twoStepBefore 0;
    Pressure_oneStepBefore 0;
    Pressure_start  5.49249e-156;
}


// ************************************************************************* //
