elasticHBPF_nochemical_mechanical_stabilization/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     elasticHBPFThrombolytic;
adjustTimeStep  no;
maxCo           0.5;
maxCoUs         0.5;
maxDeltaT       5e-2;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          5e-2;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;





// ************************************************************************* //
