elasticHBPF_nochemical_mechanical_stabilization/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       0;
        relTol          0.00001;
        smoother        GaussSeidel;
        cacheAgglomeration no;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "pcorr.*"
    {
        $p
        tolerance       0.0002;
        relTol          0;
    }

   "(U|Us)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
	maxIter         1000;
    }

    "(U|Us)Final"
    {
        $U;
        relTol          0;
    }

    epss
    {
        solver          smoothSolver;
	smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }    

    epssFinal
    {
        $epss;
        relTol          0;
    }

    "(D|T)"
    {
        solver          smoothSolver;
	smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.9;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }
    "(ntPA_F|nPLG_F|nPLS_F|nPLS_Fw|ntot)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }

    "(ntPA_F|nPLG_F|nPLS_F|nPLS_Fw|ntot)Final"
    {
        $ntPA_F;
        tolerance       1e-06;
        relTol          0;
    }
    "(C|CtPA|CPLG|CPLS|CFBG|CAP|CPAI|CMG|CPLS_AP)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }

    "(C|CtPA|CPLG|CPLS|CFBG|CAP|CPAI|CMG|CPLS_AP)Final"
    {
        $C;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;

    pRefCell    0;
    pRefValue    0;
}

relaxationFactors
{
    equations
    {
       U   0.9;
       ".*"            1;
    }
}

stressAnalysis
{
    compactNormalStress yes;
    nCorrectors     5;
    D               1e-06;
}

// ************************************************************************* //
