elasticHBPF_nochemical_mechanical_stabilization/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue epss 1e-6
);

regions
(
    boxToCell
    {
        box (0.003 0 0) (0.007 0.003 0.0001);

        fieldValues
        (
            volScalarFieldValue epss 0.05
        );
    }
);

// ************************************************************************* //
